[
  {
    "id": 15,
    "type": "repetitions",
    "title": "Вращение тазом стоя",
    "description": "Стоя, стопы на ширине плеч, руки на тазовых костях. Переносите вес по кругу, рисуя тазом максимальный комфортный круг: 8 раз по часовой стрелке и 8 против, удерживая плечи и грудную клетку неподвижными.",
    "repetitions": "8+8"
  },
  {
    "id": 14,
    "type": "repetitions",
    "title": "Круги согнутыми коленями",
    "description": "Опираясь рукой о стену или спинку стула, поднимайте бедро до параллели и рисуйте согнутым коленом круг: 5 раз по часовой стрелке и 5 раз против. Повторите другой ногой, удерживая корпус неподвижным.",
    "repetitions": "5+5"
  },
  {
    "id": 12,
    "type": "repetitions",
    "title": "Отведение ноги в сторону стоя",
    "description": "Стоя боком к устойчивой опоре и удерживая корпус вертикальным, без резинки отводите прямую ногу максимально далеко в сторону и медленно возвращайте. Не разворачивайте носок и не наклоняйте корпус.",
    "repetitions": "10+10"
  },
  {
    "id": 6,
    "type": "timer",
    "title": "Баланс на блоке — глаза открыты",
    "description": "Стоя на устойчивом блоке, стопы на ширине бедер, тело вертикально. Удерживайте равновесие с открытыми глазами 30 секунд; повторите при необходимости, сохраняя контроль и мягкое колено.",
    "duration": 30
  },
  {
    "id": 2,
    "type": "sequence",
    "title": "На высокой основе: горизонтальная голень и мягкое качание",
    "description": "Правая нога упирается в устойчивую поверхность на уровне середины бедра, колено согнуто. Сначала удерживайте голень горизонтально, затем мягко опускайте колено и выполняйте лёгкие качания. Каждое движение — 20-30 секунд одной ногой, потом повтор другой.",
    "steps": [
      { "label": "Правая: голень горизонтально, лёгкое надавливание", "time": 25 },
      { "label": "Левая: голень горизонтально, лёгкое надавливание", "time": 25 },
      { "label": "Правая: мягкое опускание и маленькие качания колена", "time": 25 },
      { "label": "Левая: мягкое опускание и маленькие качания колена", "time": 25 }
    ]
  },
  {
    "id": 7,
    "type": "timer",
    "title": "Лёжа: диагональный тянущий ход",
    "description": "Лёжа на спине, тянитесь рукой по диагонали к бедру вытянутой ноги; делайте 5-8 повторов каждой стороны, сохраняя мягкую стабилизацию таза.",
    "duration": 45
  },
  {
    "id": 9,
    "type": "timer",
    "title": "Лёжа: качание обеими коленями",
    "description": "Согните колени и качайте их из стороны в сторону, удерживая таз ровным и активируя кор. Сделайте 8-12 качаний, возвращаясь в центр между повторениями.",
    "duration": 45
  },
  {
    "id": 10,
    "type": "timer",
    "title": "Лёжа: одно колено внутрь",
    "description": "Согнутое колено тяните к центру туловища, удерживая бедро на полу и не допуская боли. Сделайте 6-10 повторов каждой ноги, чередуя стороны.",
    "duration": 45
  },
  {
    "id": 11,
    "type": "timer",
    "title": "Лёжа: растяжка согнутых коленей в стороны",
    "description": "Лёжа на спине, ноги согнуты, стопы сомкнуты. Мягко разводите колени в стороны, растягивая внутреннюю поверхность бедер и сохраняя поясницу на полу. 30 секунд, дыхание ровное, легкое напряжение.",
    "duration": 30
  },
  {
    "id": 3,
    "type": "timer",
    "title": "Бантик",
    "description": "Сидя, одна нога (верхняя) полностью кладётся коленом на другую, как при перекрещивании в позе. Просуньте руки под верхней ногой и обхватите кистями нижнюю под коленом, мягко тяните её на себя. Удерживайте 20-30 секунд на каждую сторону, избегая усилий и сохраняя дыхание ровным.",
    "duration": 30
  },
  {
    "id": 4,
    "type": "timer",
    "title": "Лёжа: бабочка к себе",
    "description": "Лёжа на спине, одна нога остаётся на полу, другая ставится внешней частью стопы на колено опорной ноги, образуя полый треугольник. Руками за колено ноги «крыла» мягко тяните его к себе, как при бантике, ощущая мягкое тянущее напряжение в бедре. 20-30 секунд на каждую сторону, без давления на чашечку, дыхание ровное.",
    "duration": 30
  },
  {
    "id": 5,
    "type": "timer",
    "title": "Лёжа: бабочка — от себя",
    "description": "Лёжа на спине, верхняя нога ставится внешней частью ступни на колено другой, образуя полый треугольник. Под нижнюю часть колена ноги «крыла» подставьте йога-кирпич и отталкивайте ногу от себя, мягко открывая внутреннюю поверхность бедра, не давя на коленную чашечку. 20-30 секунд, 1-2 подхода с ровным дыханием.",
    "duration": 30
  },
  {
    "id": 8,
    "type": "timer",
    "title": "Лёжа: носки внутрь-наружу",
    "description": "Лёжа на спине, двигайте носки внутрь и наружу в комфортном диапазоне, следя, чтобы бедра оставались на полу. Выполняйте 10-15 повторов с контролем.",
    "duration": 45
  },
  {
    "id": 13,
    "type": "repetitions",
    "title": "Лёжа: вращения ступнями",
    "description": "Лёжа на спине с вытянутыми ногами, стопы слегка приподняты. Выполняйте круговые движения ступнями: по 10 кругов внутрь и наружу каждой ногой, сохраняя расслабленные колени и ровное дыхание.",
    "repetitions": "10+10"
  }
]
